{
     "jobs": [
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T05:23",
               "sourced": "public domain",
               "unique": 1386673,
               "companyName": "Noir Consulting",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": ".NET Developer C#.NET 🏆",
               "description": ".NET Developer 💰 Salary: 35000 - 65000 GBP per year  At Noir Consulting we are looking for a C#.NET engineer!  🛠️ Our tech stack: API, ASP.NET, Angular, Architect, Azure, Bootstrap, C#, Cloud, JavaScript, MVC, SQL, Web, microservices, .NET  📝 Rquirements: - Knowledge of .NET, .NET Core, ASP.NET MVC, C#, and SQL Server - Familiarity with .NET 8, Web API 2, Entity Framework, Microservices, Azure, JavaScript, Angular 17, Bootstrap, Agile, and SQL Server 2022 - Eligibility to work in the UK  👩‍💻👨‍💻 Your responsibilities are: - Collaborate in building software applications and cloud platforms for advanced data analytics - Contribute to capturing information from high-speed tests - Support the development of a subsonic train transportation system  View this job and over 500 other transparent jobs with salaries (💰💰💰) & tech stacks (🛠️) on DevITjobs.uk  Category: C#.NET Developer / Engineer Location address: High Street 77, London, United Kingdom  Salary: 35000 - 65000 GBP per year  Benefits & perks that we offer:  Noir Consulting - More about us and the role: Have you ever thought about getting from London to Edinburgh in 30 minutes? My client, a world leader in aerospace technology, is embarking on research into a subsonic train transportation system, akin to Hyperloop. We are seeking talented .NET Developers to join our R&D centers in the UK, located in Watford, Hertfordshire, or work remotely. In addition to a competitive salary of £35,000 - £65,000, we offer a 15% bonus, 10% pension, weekly office code competition, 5 days of brainstorming time per month, and 28 days of holiday plus an extra day off on your birthday. Join us and be part of our innovative team!  Are you looking for C#.NET jobs in London",
               "link": "https://zobjobs.com/job/net-developer-cnet-job-in-uk-zj6qeta6nctd",
               "category": [
                    ".NET"
               ],
               "location": "United Kingdom UK",
               "country": "GB"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T05:15",
               "sourced": "public domain",
               "unique": 1386672,
               "companyName": "Dayforce",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Senior Full Stack Software Developer",
               "description": "Location: Work is what you do, not where you go. For this role, we are open to remote work and can hire anywhere in the United States or Canada.  About The Opportunity  The Dayforce P&T Organization is looking for an experienced Senior Full Stack Software Developer to be part of a team creating the industry’s next generation Human Capital Management (HCM) solutions, particularly focused on Tax & Payments (T&P) payroll back-office platforms.  The T&P technology organization is on a major and ambitious transformation journey to modernize and streamline multiple disparate systems that have been developed organically over many decades. Reporting to the Senior Manager Development, the Senior Full Stack Software Developer will contribute to developing an end-to-end architectural vision of the T&P application ecosystem and will assist in its realization.  In your role as Senior Full Stack Software Developer, you will be part of a scrum team comprised of high caliber, hands-on software professionals who aim to provide technical leadership and stewardship of the Dayforce Tax and Payment Solutions. You are responsible for designing, implementing, and integrating new products and features as well as completing and augmenting existing solutions and services. You work in collaborative manner with fellow Developers, Architects, Test Analysts, Product Managers, UX and other stakeholders throughout the development process to ensure the product is functionally complete and well-engineered.  If you are a technology enthusiast, have passion for creating great software, want to see your creation make an impact, and possess one or more of the following qualifications, we want to talk to you.   What You’ll Get To Do • Drive the design and implementation of highly scalable and available innovative solutions • You will be involved in conducting and participating in design and code reviews, unit, feature, and regression testing, and will collaborate with other software development teams and other departments on developing application solutions • Collaborate with cross-functional teams to identify and solve complex problems • Mentor and train fellow software engineers on architecture, design, and software development best practices to help create a top-tier engineering organization • Create working proof-of-concepts and recommend modern technologies to ensure solutions are scalable, maintainable and of high quality • Participate in Product discussions to advise on and influence the Product Roadmap • Take ownership and responsibility for development initiatives and make them happen • Contribute to the engineering process and culture to continuously improve software development processes and practices  Skills And Experience We Value • Strong object-oriented design principles and extensive hands-on experience using C#, .NET, .NET Core or Java/Spring Boot framework • Significant experience with front-end languages, libraries, and frameworks (Angular, React, Vue.Js, Node.js, GraphQL) • Hands on experience in building and leading cloud-based application development with public cloud platforms (Azure / AWS / GCP) • Experience with designing and implementing RESTAPIs • Experience with advanced programming constructs such as multi-threaded programming, event-driven architecture, messaging • Experience working with a microservice architecture • Hands on experience in applying design patterns, writing unit tests and optimizing performance • Experience with TSQL and relational database systems and exposure to NoSQL and Key-Value Database systems such as MongoDB • Experience in Docker, Kubernetes, or other container-related technologies • Knowledge of DevOps CI/CD pipelines, processes, and best practices  What Would Make You Really Stand Out • Kafka, NoSQL DB, Elastic Search, Specflow, Kubernetes, Git, gRPC, protobuf, NuGet packaging • Experience in designing authentication and fine-granted authorization mechanisms in the applications and web services OAuth, OpenID • Excellent analytical skills, Passion for solving hard problems, and knows how to have fun! • Excellent communication and collaboration skills and effective at representing a team of professionals • Ability to learn new software languages, frameworks, and APIs quickly • Disciplined self-starter, capable of working independently or in close collaboration within an agile development team • Strong agile skillset and experience working in an Agile Development environment",
               "link": "https://zobjobs.com/job/senior-full-stack-software-developer-job-in-canada-zj6qeta5uuu5",
               "category": [
                    "Software Developer",
                    "Full Stack Developer"
               ],
               "location": "Canada CA",
               "country": "CA"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T05:15",
               "sourced": "public domain",
               "unique": 1386671,
               "companyName": "Bank of Montreal",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Senior Software Developer",
               "description": "Application Deadline:  02/18/2024  Address: 100 King Street West  Keys for the role • Developer with 5-10 years of C# development experience • Banking / Financial industry experience preferred • Knowledge of VaR and financial instruments • Market Risk experience would be ideal  #BFUTRBMO2023  Drives the overall software development lifecycle including working across functional teams to transform requirements into features, managing development teams and processes, and conducting software testing and maintenance. Specific project areas of focus includes translating user requirements into technical specifications, writing code and managing the preparation of design specifications. Supports system design, provides advice on security requirements and debugs business systems and service applications. Applies deep knowledge of algorithms, data structures and programming languages to develop high quality technology applications and services - including tools, standards, and relevant software platforms based on business requirements. • Translates user needs into technical specifications by understanding, conceptualizing, and facilitating technical requirements from user.​ • Analyzes, develops, tests, and implements new software programs, and documentation of entire software development life cycle execution. • Performs preventative and corrective maintenance, troubleshooting and fault rectification of system and core software components​. • Ensures that code/configurations adhere to the security, logging, error handling, and performance standards and non-functional requirements.​ • Evaluates new technologies for fit with the program/system/eco-system and the associated upstream and downstream impacts on process, data, and risk. • Follows release management processes and standards, and applies version controls. ​ • Assists in interpreting and documentation of client requirements.​ • Focus is primarily on business/group within BMO; may have broader, enterprise-wide focus. • Provides specialized consulting, analytical and technical support. • Exercises judgment to identify, diagnose, and solve problems within given rules. • Works independently and regularly handles non-routine situations. • Broader work or accountabilities may be assigned as needed.  Qualifications:  Foundational level of proficiency: • Creative thinking. • Building and managing relationships. • Emotional agility.  Intermediate level of proficiency: • Quality Assurance and Testing. • Cloud computing. • Microservices. • Technology Business Requirements Definition, Analysis and Mapping. • Adaptability. • Learning Agility. • Verbal & written communication skills. • Collaboration & team skills. • Analytical and problem solving skills. • Data driven decision making.  Advanced level of proficiency: • Programming. • Applications Integration. • Test Driven Development. • System Development Lifecycle. • Troubleshooting. • System and Technology Integration. • Typically between 5 - 7 years of relevant experience and post-secondary degree in related field of study or an equivalent combination of education and experience. • Deep knowledge and technical proficiency gained through extensive education and business experience.  Grade: 7  Job Category: Individual Contributor / Collaborateur  We’re here to help  At BMO we are driven by a shared Purpose: Boldly Grow the Good in business and life. It calls on us to create lasting, positive change for our customers, our communities and our people. By working together, innovating and pushing boundaries, we transform lives and businesses, and power economic growth around the world.  As a member of the BMO team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one – for yourself and our customers. We’ll support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and network-building opportunities, we’ll help you gain valuable experience, and broaden your skillset.  BMO is committed to an inclusive, equitable and accessible workplace. By learning from each other’s differences, we gain strength through our people and our perspectives. Accommodations are available on request for candidates taking part in all aspects of the selection process. To request accommodation, please contact your recruiter",
               "link": "https://zobjobs.com/job/senior-software-developer-job-in-canada-zj6qeta5us5i",
               "category": [
                    "Software Developer"
               ],
               "location": "Canada CA",
               "country": "CA"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T05:13",
               "sourced": "public domain",
               "unique": 1386670,
               "companyName": "BMO",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Senior Software Developer",
               "description": "<div class=\"jd-info au-target\" data-ph-at-id=\"jobdescription-text\" data-ph-id=\"ph-page-element-page21-IR612h\" au-target-id=\"120\"><div><div><div><div><div><div><div><div><div><div><div><div><div><div><p><span>Application Deadline:</span></p></div></div></div></div></div></div></div></div></div></div></div></div></div></div>02/07/2024<p aria-hidden=\"true\"></p><p aria-hidden=\"true\"></p><p style=\"text-align:left\"><span>Address:</span></p>100 King Street West<p style=\"text-align:inherit\" aria-hidden=\"true\"></p><p style=\"text-align:inherit\" aria-hidden=\"true\"></p><div><div><div><div><div><div><div><p style=\"text-align:left\">Job Family Group:</p></div></div></div></div></div></div></div>Technology<p style=\"text-align:inherit\" aria-hidden=\"true\"></p><p style=\"text-align:inherit\" aria-hidden=\"true\"></p><p><b>Keys for the role</b></p><ul><li><span><span>Developer with 5-10 years of C# development experience</span></span></li><li><span><span>Banking / Financial industry experience preferred </span></span></li><li><span><span><span>Knowledge of VaR and financial instruments</span></span></span></li><li><span><span>Market Risk experience would be ideal</span></span></li></ul><p aria-hidden=\"true\"></p><p><b><i><span>#BFUTRBMO2023</span></i></b></p><p style=\"text-align:inherit\" aria-hidden=\"true\"></p><p style=\"text-align:inherit\" aria-hidden=\"true\"></p><p>Drives the overall software development lifecycle including working across functional teams to transform requirements into features, managing development teams and processes, and conducting software testing and maintenance. Specific project areas of focus includes translating user requirements into technical specifications, writing code and managing the preparation of design specifications. Supports system design, provides advice on security requirements and debugs business systems and service applications. Applies deep knowledge of algorithms, data structures and programming languages to develop high quality technology applications and services - including tools, standards, and relevant software platforms based on business requirements.</p><ul><li>Translates user needs into technical specifications by understanding, conceptualizing, and facilitating technical requirements from user.​</li><li>Analyzes, develops, tests, and implements new software programs, and documentation of entire software development life cycle execution.</li><li>Performs preventative and corrective maintenance, troubleshooting and fault rectification of system and core software components​.</li><li>Ensures that code/configurations adhere to the security, logging, error handling, and performance standards and non-functional requirements.​</li><li>Evaluates new technologies for fit with the program/system/eco-system and the associated upstream and downstream impacts on process, data, and risk.</li><li>Follows release management processes and standards, and applies version controls. ​</li><li>Assists in interpreting and documentation of client requirements.​</li><li>Focus is primarily on business/group within BMO; may have broader, enterprise-wide focus.</li><li>Provides specialized consulting, analytical and technical support.</li><li>Exercises judgment to identify, diagnose, and solve problems within given rules.</li><li>Works independently and regularly handles non-routine situations.</li><li>Broader work or accountabilities may be assigned as needed.<p><b>Qualifications:</b></p> <p><u>Foundational level of proficiency</u>:</p></li><li>Creative thinking.</li><li>Building and managing relationships.</li><li>Emotional agility.<p><u>Intermediate level of proficiency</u>:</p></li><li>Quality Assurance and Testing.</li><li>Cloud computing.</li><li>Microservices.</li><li>Technology Business Requirements Definition, Analysis and Mapping.</li><li>Adaptability.</li><li>Learning Agility.</li><li>Verbal & written communication skills.</li><li>Collaboration & team skills.</li><li>Analytical and problem solving skills.</li><li>Data driven decision making.<p><u>Advanced level of proficiency</u>:</p></li><li>Programming.</li><li>Applications Integration.</li><li>Test Driven Development.</li><li>System Development Lifecycle.</li><li>Troubleshooting.</li><li>System and Technology Integration.</li><li>Typically between 5 - 7 years of relevant experience and post-secondary degree in related field of study or an equivalent combination of education and experience.</li><li>Deep knowledge and technical proficiency gained through extensive education and business experience.</li></ul><p style=\"text-align:inherit\" aria-hidden=\"true\"></p><p style=\"text-align:inherit\" aria-hidden=\"true\"></p><p style=\"text-align:left\"><b>We’re here to help</b></p><p style=\"text-align:inherit\" aria-hidden=\"true\"></p><p style=\"text-align:left\">At BMO we are driven by a shared Purpose: Boldly Grow the Good in business and life. It calls on us to create lasting, positive change for our customers, our communities and our people. By working together, innovating and pushing boundaries, we transform lives and businesses, and power economic growth around the world.</p><p style=\"text-align:inherit\" aria-hidden=\"true\"></p><p style=\"text-align:left\">As a member of the BMO team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one – for yourself and our customers. We’ll support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and network-building opportunities, we’ll help you gain valuable experience, and broaden your skillset.</p><p style=\"text-align:inherit\" aria-hidden=\"true\"></p><p style=\"text-align:left\">To find out more visit us at <a target=\"_blank\" href=\"https://jobs.bmo.com/ca/en\"><span class=\"WAP2\">https://jobs.bmo.com/ca/en</span></a>.</p><p style=\"text-align:inherit\" aria-hidden=\"true\"></p><p style=\"text-align:left\">BMO is committed to an inclusive, equitable and accessible workplace. By learning from each other’s differences, we gain strength through our people and our perspectives. Accommodations are available on request for candidates taking part in all aspects of the selection process. To request accommodation, please contact your recruiter.</p><p style=\"text-align:inherit\" aria-hidden=\"true\"></p><p style=\"text-align:left\">Note to Recruiters: BMO does not accept unsolicited resumes from any source other than directly from a candidate. Any unsolicited resumes sent to BMO, directly or indirectly, will be considered BMO property. BMO will not pay a fee for any placement resulting from the receipt of an unsolicited resume. A recruiting agency must first have a valid, written and fully executed agency agreement contract for service to submit resumes.</p></div>",
               "link": "https://zobjobs.com/job/senior-software-developer-job-in-canada-zj6qeta5qf25",
               "category": [
                    "Software Developer"
               ],
               "location": "Toronto Ontario Canada CA",
               "country": "CA"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T05:13",
               "sourced": "public domain",
               "unique": 1386669,
               "companyName": "Bank of Montreal",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Senior Software Developer",
               "description": "<div><div><div><div><div><div><div><p><span>Application Deadline:</span></p></div></div></div></div></div></div></div>02/18/2024<p></p><p></p><p style=\"text-align:left\">Address:</p>100 King Street West<p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p><b>Keys for the role</b></p><ul><li><span><span>Developer with 5-10 years of C# development experience</span></span></li><li><span><span>Banking / Financial industry experience preferred </span></span></li><li><span><span><span>Knowledge of VaR and financial instruments</span></span></span></li><li><span><span>Market Risk experience would be ideal</span></span></li></ul><p></p><p><b><i><span>#BFUTRBMO2023</span></i></b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:inherit\"></p><p>Drives the overall software development lifecycle including working across functional teams to transform requirements into features, managing development teams and processes, and conducting software testing and maintenance. Specific project areas of focus includes translating user requirements into technical specifications, writing code and managing the preparation of design specifications. Supports system design, provides advice on security requirements and debugs business systems and service applications. Applies deep knowledge of algorithms, data structures and programming languages to develop high quality technology applications and services - including tools, standards, and relevant software platforms based on business requirements.</p><ul><li>Translates user needs into technical specifications by understanding, conceptualizing, and facilitating technical requirements from user.​</li><li>Analyzes, develops, tests, and implements new software programs, and documentation of entire software development life cycle execution.</li><li>Performs preventative and corrective maintenance, troubleshooting and fault rectification of system and core software components​.</li><li>Ensures that code/configurations adhere to the security, logging, error handling, and performance standards and non-functional requirements.​</li><li>Evaluates new technologies for fit with the program/system/eco-system and the associated upstream and downstream impacts on process, data, and risk.</li><li>Follows release management processes and standards, and applies version controls. ​</li><li>Assists in interpreting and documentation of client requirements.​</li><li>Focus is primarily on business/group within BMO; may have broader, enterprise-wide focus.</li><li>Provides specialized consulting, analytical and technical support.</li><li>Exercises judgment to identify, diagnose, and solve problems within given rules.</li><li>Works independently and regularly handles non-routine situations.</li><li>Broader work or accountabilities may be assigned as needed.<p><b>Qualifications:</b></p> <p><u>Foundational level of proficiency</u>:</p></li><li>Creative thinking.</li><li>Building and managing relationships.</li><li>Emotional agility.<p><u>Intermediate level of proficiency</u>:</p></li><li>Quality Assurance and Testing.</li><li>Cloud computing.</li><li>Microservices.</li><li>Technology Business Requirements Definition, Analysis and Mapping.</li><li>Adaptability.</li><li>Learning Agility.</li><li>Verbal & written communication skills.</li><li>Collaboration & team skills.</li><li>Analytical and problem solving skills.</li><li>Data driven decision making.<p><u>Advanced level of proficiency</u>:</p></li><li>Programming.</li><li>Applications Integration.</li><li>Test Driven Development.</li><li>System Development Lifecycle.</li><li>Troubleshooting.</li><li>System and Technology Integration.</li><li>Typically between 5 - 7 years of relevant experience and post-secondary degree in related field of study or an equivalent combination of education and experience.</li><li>Deep knowledge and technical proficiency gained through extensive education and business experience.</li></ul><p style=\"text-align:left\">Grade:</p>7<p style=\"text-align:left\">Job Category:</p>Individual Contributor / Collaborateur<p style=\"text-align:left\"><b>We’re here to help</b></p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">At BMO we are driven by a shared Purpose: Boldly Grow the Good in business and life. It calls on us to create lasting, positive change for our customers, our communities and our people. By working together, innovating and pushing boundaries, we transform lives and businesses, and power economic growth around the world.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">As a member of the BMO team you are valued, respected and heard, and you have more ways to grow and make an impact. We strive to help you make an impact from day one – for yourself and our customers. We’ll support you with the tools and resources you need to reach new milestones, as you help our customers reach theirs. From in-depth training and coaching, to manager support and network-building opportunities, we’ll help you gain valuable experience, and broaden your skillset.</p><p style=\"text-align:inherit\"></p><p style=\"text-align:left\">BMO is committed to an inclusive, equitable and accessible workplace. By learning from each other’s differences, we gain strength through our people and our perspectives. Accommodations are available on request for candidates taking part in all aspects of the selection process. To request accommodation, please contact your recruiter.</p>",
               "link": "https://zobjobs.com/job/senior-software-developer-job-in-canada-zj6qeta5qa4c",
               "category": [
                    "Software Developer"
               ],
               "location": "Toronto Ontario Canada CA",
               "country": "CA"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T05:08",
               "sourced": "public domain",
               "unique": 1386668,
               "companyName": "Infosys",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Python Developer",
               "description": "Infosys is seeking a Python Developer. This position’s primary responsibility will be to provide technical expertise and coordinate for day to day deliverables for the team. The chosen candidate will assist in the technical design of large business systems; builds applications, interfaces between applications, understands data security, retention, and recovery. The role holder should be able to research on technologies independently to recommend appropriate solutions & should contribute to technology-specific best practices & standards; contribute to success criteria from design through deployment, including, reliability, cost-effectiveness, performance, data integrity, maintainability and scalability; contributes expertise on significant application components, program languages, databases, operating systems, etc., and guides/mentors the team during the build and test phases.  Required Qualifications  • Bachelor’s degree or foreign equivalent required from an accredited institution. Will also consider three years of progressive experience in the specialty in lieu of every year of education.  • At least 4 years of Information Technology experience.  • Candidate must be located within commuting distance of Jersey City, NJ or be willing to relocate to the area. This position may require travel to project locations.  • U.S. citizens and those authorized to work in the U.S. are encouraged to apply. We are unable to sponsor at this time.  • Experience in Python programming  • Experience in end-to-end implementation of projects in Python, from Analysis, Design, Model to Coding & testing and promote to production, especially Python server-side backend programming  • Good understanding of OOPS concepts  • Strong knowledge in Data Structures, Algorithms, Collections, Multi-threading and memory management, concurrency (GIL)  • Strong knowledge and hands-on experience in SQL, Unix shell scripting  Preferred Qualifications  • At least 4 years of experience in Python Programming  • Good knowledge in SQL, Unix shell scripting, Python Memory Management and concurrency (GIL)  • Experience in working Python Frameworks like Django / Flask  • Good knowledge in React.js, RESTful APIs and of web-capable devices and browsers  • Sound Knowledge of Software engineering design patterns and practices  • Strong understanding of Functional programming, basic data structures and algorithms  • Experience in Banking and Finance domain.  • Experience with Agile Development, SCRUM, or Extreme Programming methodologies.  • Strong problem solving, analytical and interpersonal skills.  • Excellent written & verbal communication, ability to multitask, work well under demanding situations, prioritize and meet deadline  Desired Skills:  • Experience in Banking and Finance domain.  • Experience with Agile Development, SCRUM, or Extreme Programming methodologies.  • Strong problem solving, analytical and interpersonal skills.  • Excellent written & verbal communication, ability to multitask, work well under demanding situations, prioritize and meet deadline",
               "link": "https://zobjobs.com/job/python-developer-job-in-usa-zj6qeta5b5em",
               "category": [
                    "Python"
               ],
               "location": "United States US",
               "country": "US"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T05:04",
               "sourced": "public domain",
               "unique": 1386667,
               "companyName": "Harnham",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Full-Stack Software Developer",
               "description": "FULL-STACK SOFTWARE DEVELOPER  3-MONTH CONTRACT  LONDON (FULLY REMOTE)  £500-£520 PER DAY  This position as a Full-Stack Software Developer allows you to work with a dynamic US-based media consultancy company. This contract will allow you to work on a technically varied project building an app to show market insights for publishing houses and media companies.  THE ROLE  As a Full-Stack Software Developer, you will be involved in building a front-end application for media/market insights.  The objective is to mainly use React and JavaScript to bring the idea to life. Additionally, you will be: • Advising and offering insights into the project • Creating documentation of the process to relay to nontechnical specialists  KEY SKILLS AND REQUIREMENTS:  As a Full-Stack Software Developer, you will require the following background and skills: • Commercial experience in React (front end) • Commercial experience using Next JS (Version 14 is a plus) • Experience in Next API roots (or Node Express or Express JS) • Typescript (back end) • MongoDB (storage/database) • Tailwind  HOW TO APPLY  Please register your interest by sending your CV to Parul Munakhya via the apply link on this page.  Desired Skills and Experience • Commercial experience in React (front-end) • Commercial experience using Next JS (Version 14 is a plus) • Experience in Next API roots (or Node Express or Express JS) • Typescript (back end) • MongoDB (storage/database) • Tailwind",
               "link": "https://zobjobs.com/job/fullstack-software-developer-job-in-uk-zj6qeta4u0up",
               "category": [
                    "Software Developer",
                    "Developer",
                    "Software",
                    "Full Stack Developer"
               ],
               "location": "United Kingdom UK",
               "country": "GB"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T05:04",
               "sourced": "public domain",
               "unique": 1386666,
               "companyName": "Oho Group",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Graduate Software Developer - London - Hybrid",
               "description": "<div><div>Graduate Software Developer - London - Hybrid \n \nA London based successful technology focused hedge fund are looking to take on strong, driven Software Developers to join their talented team where they can learn and develop their skills. They are looking for any OO background as well as the desire to work in the finance industry. They aren't the type of company who work long hours in high pressure environments. This is a very unique software development opportunity that most financial institutions will not be able to offer. You will be creating highly innovative and complicated applications for high frequency trading systems that are used to transfer millions of pounds every single day. \n \nRequirements: \n<ul><li>Self-starter, driven and motivated indiviudal</li><li>\nA degree in Computer Science or simiar</li><li>\nAny OO programming language</li></ul> \n \nGraduate Software Developer - London - Hybrid</div></div>",
               "link": "https://zobjobs.com/job/graduate-software-developer-london-hybrid-job-in-uk-zj6qeta4t7n6",
               "category": [
                    "Software Developer"
               ],
               "location": "London England UK",
               "country": "GB"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T05:02",
               "sourced": "public domain",
               "unique": 1386665,
               "companyName": "LanceSoft, Inc.",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Python Developer",
               "description": "Description:  We are seeking two engineers with experience in API development in Python. Experience with AWS Lambda is also important. Engineers should have experience writing reliable, production-grade code in addition to working with data structures and algorithms. Domain experience working with Access Management or Cyber Security data is a plus but not strictly required  Required Skills  -Python Programming  -API Development  AWS Experience  -Cyber/Identity Access Management Experience",
               "link": "https://zobjobs.com/job/python-developer-job-in-usa-zj6qeta4ok4a",
               "category": [
                    "Python"
               ],
               "location": "United States US",
               "country": "US"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T05:01",
               "sourced": "public domain",
               "unique": 1386664,
               "companyName": "TRM Technologies Inc.",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Programmer/Software Developer Level 2",
               "description": "Location Ottawa (remote) Language English or French Required Security Clearance Reliability Security Clearance Required  Role And Responsibilities  Our Federal Government client requires a Programmer with 5+ years experience to Develop, plan, Analyze, Evaluate requirements with team and project authorities.  Qualifications And Experience • 5+ years of extensive experience with .Net (including .Net Core) as a Programmer/Software Developer. • 5+ years of extensive experience with SQL Server as a Programmer/Software Developer. • 3+ years of extensive experience of application development using Microsoft Azure Cloud Services. • 3+ years of extensive experience of database development and administration using Microsoft Azure SQL. • 3+ years of extensive experience of application development using ReactJS. • Experience developing an interactive diagramming tool used by end-users to create and edit a process flow diagram (or equivalent), using a JavaScript framework diagramming library.  If interested please email jnickpor@trm.ca  We would like to thank all applicants, however only those accepted for an interview will be contacted",
               "link": "https://zobjobs.com/job/programmer-software-developer-level-2-web-job-in-canada-zj6qeta4k3li",
               "category": [
                    "Web",
                    "Software Developer"
               ],
               "location": "Canada CA",
               "country": "CA"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T05:00",
               "sourced": "public domain",
               "unique": 1386663,
               "companyName": "Robert Half",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Web Developer",
               "description": "Exciting Job Opportunity: Contract .NET Developer Extraordinaire!Are you ready to ignite your career in a dynamic, fast-paced environment? We are seeking a passionate .NET Developer to join our clients innovative software development team at the forefront of cutting-edge solutions.About the Role:As a pivotal member of the team, youll report directly to the Senior Solutions Architect and dive into a realm of creativity and innovation. Your mission? Developing, maintaining, and enhancing a spectrum of technology-based solutions that will reshape the future. From collaborating with project management to delivering tier 3 support, youll be the driving force behind software evolution.Your Responsibilities and Adventures Await:Strategic Innovation:Join forces with IT teams to align technical requirements with business goals and industry standards.Stay ahead of the curve by exploring new development technologies to propel their vision forward.Crafting Software Marvels:Design, implement and test bespoke software solutions, from .NET Core applications to legacy system migrations.Ensure seamless integration and document every step of the way for future reference and improvement.Operational Excellence:Serve as the guardian of operational support, ensuring the software operates at peak performance.Keep your finger on the pulse of corporate policies and standards, guiding the development journey.Champion development standards and guidelines, orchestrating release cycles like a maestro.Your Impact and Reach:Your contributions will reverberate across the entire company, touching every corner where custom business applications thrive. Youll collaborate with a diverse range of stakeholders, from peers to business owners, fueling their collective success",
               "link": "https://zobjobs.com/job/web-developer-job-in-canada-zj6qeta4il7q",
               "category": [
                    "Web",
                    "Website",
                    "Software Developer"
               ],
               "location": "Canada CA",
               "country": "CA"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T05:00",
               "sourced": "public domain",
               "unique": 1386662,
               "companyName": "eTeam",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Full Stack Developer",
               "description": "Full Stack Developer • 6+ years of experience using Java, Spring Boot, REST Web Services \n• Experienced in developing in PHP using relevant frameworks like Martini, Revel, Lumen and Laravel \n• Experienced in Angular 8, HTML5, CSS, Java Script \n• Experienced in relational databases (e.g. PostgreSQL, Oracle, Aurora DB) \n• Experience in Java/Springboot and related technologies \n• Strong industry experience in designing and developing scalable production quality REST APIs. \n• Strong knowledge of version control systems (GIT, SVN etc.), build repository system (artifactory or maven), CI/CD tools (Jenkins, Gitlab CI). \n• Experience with Agile tools and methodologies (e.g. - Atlassian suite) \n• Prior experience with cloud technologies (Docker, Artifactory, Azure, AWS) preferred \n• Operates with minimal supervision and performs moderate to difficult technical tasks Independently \n• Excellent team player and acts as mentor in own area",
               "link": "https://zobjobs.com/job/full-stack-developer-web-job-in-canada-zj6qeta4ibkj",
               "category": [
                    "Web",
                    "Website",
                    "Front End Developer"
               ],
               "location": "Brampton ON CA",
               "country": "CA"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T04:53",
               "sourced": "public domain",
               "unique": 1386661,
               "companyName": "Circle Recruitment",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Senior Full Stack Developer",
               "description": "<p>Join my client's innovative technology team, specialising in the audio and video media sector!</p><p><strong>Position: Senior Full Stack Developer </strong></p><p><strong>Salary: £65,000-£85,000</strong></p><p><strong>Location: Oxford (Remote working option, ideally hybrid 2-4 days in the office per month) </strong></p><p><strong>Current Tech Stack (Experience of all is not required for consideration): </strong></p><p>React, NodeJS, Typescript, JavaScript (migrating to TypeScript), Redux, NextJS, Electron and MySQL etc.</p><p>JIRA for project management integrated with GitHub.</p><p>Platform currently runs on AWS EC2, EB, ECS, RDS, S3, CloudFront, etc.</p><p><strong>Summary </strong></p><p>This role will involve collaborating closely with the CTO, you will play a pivotal role in shaping the platform's future to cater to its expanding user base within the audio and video media sector. The role will include working on various projects spanning from front-end development to back-end architecture and infrastructure enhancements.</p><p>Once fully onboarded you will be expected to take full end to end responsibility for projects of varying size, including requirements gathering, planning, estimation, design, implementation, automated testing and deployment to our staging and production environments.</p><p>This is a dynamic role with the option for remote work, though regular attendance at their office is advantageous.</p><p>In addition to a competitive salary, perks include comprehensive benefits such as pension plans, bonuses, flexible/remote working, 25+ days holiday plus bank holidays, time, technical equipment provided (e.g Macbook), training opportunities, and the potential for stock options in my client's rapidly growing organisation.</p><p>Qualifications:</p><ul><li>Legally eligible to work in the UK; sponsorship unavailable.</li><li>5+ Years commercial experience using React, Node, JavaScript/TypeScript and other tools related to tech stack above.</li><li>Bachelor's degree in Computer Science or a related field with honours.</li><li>Enthusiastic about making a significant impact within a dynamic startup environment.</li></ul><p></p><p>Additional Benefits:</p><ul><li>Life insurance</li><li>Relocation assistance (if applicable)</li></ul><p>If interested, please apply for immediate consideration and a call from myself. You can reach out to me directly on <a href=\"mailto:#####\">#####</a> for more information.</p><p><em>Circle Recruitment is acting as an Employment Agency in relation to this vacancy.  Earn yourself a referral bonus if you refer somebody else who fills the role!  We also offer an iPad if you refer a new client to us and we recruit for them. </em>Follow us on Facebook - Circle Recruitment , Twitter - @Circle_Rec and LinkedIn - Circle Recruitment.</p><p> </p><p> </p>",
               "link": "https://zobjobs.com/job/senior-full-stack-developer-job-in-uk-zj6qeta02kb0",
               "category": [
                    "Full Stack Developer"
               ],
               "location": "Oxfordshire  South East England UK",
               "country": "GB"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T04:52",
               "sourced": "public domain",
               "unique": 1386660,
               "companyName": "Premier Group Recruitment",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Ruby Developer Full Stack",
               "description": "<div><p><b>Ruby Full Stack Developer</b> \nReading - Once a week in the office \n&pound;60,000-&pound;70,000 \n \nI&rsquo;m currently working for a global software business who are looking for a <b>Full Stack Developer</b> with experience in <b>Ruby-on-Rails</b> to join their growing team in Reading. The company specialise in providing a variety of services to the Retail industry via their interactive platforms and have been going for nearly 15 years. They are a global company with a base in the US and their product is used by retailers worldwide. \n \nIn role you will be working on the company&rsquo;s core product and platforms, contributing to all aspects of the SDLC in an Agile environment. You will liase with stakeholders, demonstrate flexibility to work with different technologies and support junior members of the team. This is a Mid-Senior role so you will need to have at least 3 years commercial experience working with the required essential skills. \n \nThis company are based in Reading and require office working of once a week. \n \n<b>Technical Requirements</b></p>\n<ul>\n<li>Commercial development experience with <b>Ruby-on-Rails.</b></li>\n<li>Essential Skills:<b> Ruby, JavaScript, HTML, SQL, Docker/Kubernetes.</b></li>\n<li>Bonus Skills: <b>React, UI, Java, Spring, PostgreSQL, AWS/GCP.</b></li>\n<li>Confident talking requirements through with clients & stakeholders.</li>\n<li>Have worked in Agile environment and confident with all aspects of SDLC.</li>\n<li>Familiarity with testing frameworks and bug fixing.</li>\n<li>Confident working across different teams.</li></ul> \n<p> \n<b>Salary/Benefits</b></p>\n<ul>\n<li><b>&pound;60,000-&pound;70,000</b></li>\n<li>25 days holiday plus Bank Holidays.</li>\n<li>Private Medical Insurance/Dental/DIS benefit.</li>\n<li>Contributory Pension.</li>\n<li>Perk Scheme.</li>\n<li>Brand discounts.</li></ul> \n<p> \nIf this opportunity is of interest, then please send me your CV and a good time I can give you a call next week. \n \nTim Stock \n<b>01189028800 / 07980610737</b> \nhttps://www.linkedin.com/in/tim-stock-160177159/</p></div>",
               "link": "https://zobjobs.com/job/ruby-developer-full-stack-full-stack-developer-job-in-uk-zj6qet9vuufj",
               "category": [
                    "Full Stack Developer"
               ],
               "location": "Reading England UK",
               "country": "GB"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T04:36",
               "sourced": "public domain",
               "unique": 1386659,
               "companyName": "Central Business Solutions Inc.",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Front End Engineer",
               "description": "Position Role/Tile: Front End Engineer  Location: San Francisco, CA ( Remote   Software Engineer • 3-5 years of experience – focus as Front End/Web Developer, working on responsive web designs • Core Javascript (no frameworks) • HTML, CSS • Looking for confidence on the CSS/styling/design side, detail oriented • Collaboration and experience working and building relationships cross functionally (i.e. different stakeholders, creative, design team, marketing, site management, etc.)  Key Job Functions • Work with Architecture to craft technical designs and drive the evolution of our site architecture • Work in tandem with multiple groups to strategize and prioritize next generation product initiatives, develop processes and solutions, and drive projects to completion • Develop strong working relationships across levels and functions • Facilitate problem diagnosis and resolution in relevant areas • Drive change, including programs that improve developer productivity and reduce time to market • Assist Product Managers in designing and defining new features • Write code that is of high quality and consistent with our coding standards • Write automated tests of new features to ensure they are of very high quality • Review the work of other engineers in a collegial fashion to ensure the work product is of high quality and consistent with our standards • Participate in, and potentially lead, Communities-of-Practice in those technologies in which you have an interest • Participate in continuous education programs to grow your skills both technically and in the Williams-Sonoma business domain • Serve as a member of a Scrum team and participate in all planning, stand-up and retrospective meetings  Central Business Solutions, Inc,  37600 Central Ct.  Suite #214  Newark, CA 94560.  Central Business Solutions, Inc(A Certified Minority Owned Organization)  Checkout our excellent assessment tool: http://www.skillexam.com/  Checkout our job board : http://www.job-360.net/  =====================================================  Central Business Solutions, Inc  37600 Central Court Suite 214 Newark CA, 94560  Phone: (833)247-8800 Fax: (510)-740-3677  Web: http://www.cbsinfosys.com  ",
               "link": "https://zobjobs.com/job/front-end-engineer-front-end-developer-job-in-usa-zj6qet9udrk7",
               "category": [
                    "Front End Developer"
               ],
               "location": "United States US",
               "country": "US"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T04:35",
               "sourced": "public domain",
               "unique": 1386658,
               "companyName": "Adobe",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Software Frontend Development Engineer- TypeScript",
               "description": "JOB LEVEL P40  EMPLOYEE ROLE Individual Contributor  The challenge  Adobe Express is an all-in-one design, photo, and video tool to make content creation easy. Quickly and easily make spectacular social content, videos, logos, and more to stand out on social and beyond.  The Express team is on a mission to build the most sophisticated, delightful and innovative editing experience for everything image, video and beyond, by pushing the boundaries of web technologies.  We are looking for an expert front-end engineer to add to the Imaging team, well rounded in the topics of web, browsers, design, architecture and image processing.  We are working in a large-scale project, yet as an independent autonomous team, and you will be able to take ownership and contribute to significant parts of the product, bringing life to features used by millions of users.  What you’ll do • Build amazing features in the Adobe Express product • Write high quality, production ready code • Use advanced web technologies • Apply groundbreaking technologies including AI/ML image and content generation • Contribute to an architecturally complex project • Be part of a team of exceptional engineers, designers, product and customer-experience experts • Operate a high reliability and stability SaaS product • Have the opportunity to define and influence features, priorities and roadmap • Work as part of a distributed team, active member of product and project communication channels  What you need to succeed • Excellent proficiency in JavaScript, TypeScript, and in-depth knowledge of browser web technologies • Proficient in using/configuring the tooling to build, test and deliver large JavaScript/TypeScript applications (npm, rush, testing frameworks, node.js, headless) • Experience doing image processing, manipulation, compositing, or computer vision • Experience working effectively and operating independently in large software projects • Experience with web components, or proficient in one mainstream UI frameworks (React, Angular, etc.) • Design and architecture experience for complex front-end applications • Experience in improving memory and time performance in applications (web or native) • Knowledge and experience of browser technologies like WebGL, wasm, web workers, service workers, caching, local storage, debugging and profiling tools • Experience doing agile estimation, planning and working in an agile team • Customer insight and passion for a delightful user experience  What will set you apart  These are nice to haves and should not discourage you from applying • Substantial public git portfolio to showcase your skills and passion for coding • Proven experience in anything computer vision, graphic rendering, 2D or 3D, AR/VR, 3D engines • Notable public media content (blogs, channels) or public presentations • Individual research or papers on any relevant technical topics  Our compensation reflects the cost of labor across several  U.S. geographic markets, and we pay differently based on those defined markets. The U.S. pay range for this position is $124,000 -- $234,200 annually. Pay within this range varies by work location and may also depend on job-related knowledge, skills, and experience. Your recruiter can share more about the specific salary range for the job location during the hiring process.  At Adobe, for sales roles starting salaries are expressed as total target compensation (TTC = base + commission), and short-term incentives are in the form of sales commission plans. Non-sales roles starting salaries are expressed as base salary and short-term incentives are in the form of the Annual Incentive Plan (AIP).  In addition, certain roles may be eligible for long-term incentives in the form of a new hire equity award.  Internal Opportunities  Creativity, curiosity, and constant learning are celebrated aspects of your career growth journey. We’re glad that you’re pursuing a new opportunity at Adobe!  Put your best foot forward:  1. Update your Resume/CV and Workday profile – don’t forget to include your uniquely ‘Adobe’ experiences and volunteer work.  2. Visit the Internal Mobility page on Inside Adobe to learn more about the process and set up a job alert for roles you’re interested in.  3. Check out these tips to help you prep for interviews.  4. If you are applying for a role outside of your current country, ensure you review the International Resources for Relocating Employees on Inside Adobe, including the impacts to your Benefits, AIP, Equity & Payroll.  Once you apply for a role via Workday, the Talent Team will reach out to you within 2 weeks. If you move into the official interview process with the hiring team, make sure you inform your manager so they can champion your career growth.  At Adobe, you will be immersed in an exceptional work environment that is recognized around the world. You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely. If you’re looking to make an impact, Adobes the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer.  Adobe is an equal opportunity and affirmative action employer. We welcome and encourage diversity in the workplace regardless of gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other characteristics protected by law.  If you have a disability or special need that requires accommodation to navigate our internal careers site or to complete the application process, please contact accommodations@adobe.com",
               "link": "https://zobjobs.com/job/software-frontend-development-engineer-typescript-front-end-developer-job-in-usa-zj6qet9uc6qi",
               "category": [
                    "Front End Developer",
                    "Website"
               ],
               "location": "United States US",
               "country": "US"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T04:35",
               "sourced": "public domain",
               "unique": 1386657,
               "companyName": "Collabera",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Frontend Developer",
               "description": "Responsibilities: • Develop and maintain user-friendly web applications using HTML, CSS, JavaScript, and other web technologies. • Design and implement user interfaces for web applications • Ensure web applications are optimized for maximum speed and scalability. • Troubleshoot and debug web applications. • Collaborate with other developers to ensure code quality and consistency. • Stay up-to-date with the latest web technologies and trends.  Requirements: • Proven experience as a Frontend Developer. • Proficient understanding of web markup, including HTML5, CSS3. • Proficient understanding of client-side scripting and JavaScript frameworks, including jQuery. • Expertise in React/Angular, TypeScript, JavaScript and Simulator(JS, HTML, CSS) • Knowledge of web performance testing tools. • Ability to work independently and collaboratively. • Excellent problem-solving skills. • Attention to detail",
               "link": "https://zobjobs.com/job/frontend-developer-front-end-developer-job-in-usa-zj6qet9uc5rh",
               "category": [
                    "Front End Developer",
                    "html"
               ],
               "location": "United States US",
               "country": "US"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T04:34",
               "sourced": "public domain",
               "unique": 1386656,
               "companyName": "Adobe",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Software Frontend Development Engineer- TypeScript",
               "description": "<p><b>Our Company </b>  Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.    We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours! </p><p>  </p> The challenge <p>Adobe Express is an all-in-one design, photo, and video tool to make content creation easy. Quickly and easily make spectacular social content, videos, logos, and more to stand out on social and beyond.</p> <p>The Express team is on a mission to build the most sophisticated, delightful and innovative editing experience for everything image, video and beyond, by pushing the boundaries of web technologies.</p> <p>We are looking for an expert front-end engineer to add to the Imaging team, well rounded in the topics of web, browsers, design, architecture and image processing.</p> <p>We are working in a large-scale project, yet as an independent autonomous team, and you will be able to take ownership and contribute to significant parts of the product, bringing life to features used by millions of users.</p> <p></p> What you’ll do <ul><li>Build amazing features in the Adobe Express product</li> <li>Write high quality, production ready code</li> <li>Use advanced web technologies</li> <li>Apply groundbreaking technologies including AI/ML image and content generation</li> <li>Contribute to an architecturally complex project</li> <li>Be part of a team of exceptional engineers, designers, product and customer-experience experts</li> <li>Operate a high reliability and stability SaaS product</li> <li>Have the opportunity to define and influence features, priorities and roadmap</li> <li>Work as part of a distributed team, active member of product and project communication channels</li> </ul><p></p> What you need to succeed <ul><li>Excellent proficiency in JavaScript, TypeScript, and in-depth knowledge of browser web technologies</li> <li>Proficient in using/configuring the tooling to build, test and deliver large JavaScript/TypeScript applications (npm, rush, testing frameworks, node.js, headless)</li> <li>Experience doing image processing, manipulation, compositing, or computer vision</li> <li>Experience working effectively and operating independently in large software projects</li> <li>Experience with web components, or proficient in one mainstream UI frameworks (React, Angular, etc.)</li> <li>Design and architecture experience for complex front-end applications</li> <li>Experience in improving memory and time performance in applications (web or native)</li> <li>Knowledge and experience of browser technologies like WebGL, wasm, web workers, service workers, caching, local storage, debugging and profiling tools</li> <li>Experience doing agile estimation, planning and working in an agile team</li> <li>Customer insight and passion for a delightful user experience</li> </ul><p></p> What will set you apart <p>These are nice to haves and should not discourage you from applying</p> <ul><li>Substantial public git portfolio to showcase your skills and passion for coding</li> <li>Proven experience in anything computer vision, graphic rendering, 2D or 3D, AR/VR, 3D engines</li> <li>Notable public media content (blogs, channels) or public presentations</li> <li>Individual research or papers on any relevant technical topics</li> </ul><p></p>  <p></p>Our compensation reflects the cost of labor across several U.S. geographic markets, and we pay differently based on those defined markets. The U.S. pay range for this position is $124,000 -- $234,200 annually. Pay within this range varies by work location and may also depend on job-related knowledge, skills, and experience. Your recruiter can share more about the specific salary range for the job location during the hiring process.<p></p> <p>At Adobe, for sales roles starting salaries are expressed as total target compensation (TTC = base + commission), and short-term incentives are in the form of sales commission plans.  Non-sales roles starting salaries are expressed as base salary and short-term incentives are in the form of the Annual Incentive Plan (AIP).</p> <p></p> <p>In addition, certain roles may be eligible for long-term incentives in the form of a new hire equity award.</p> <p></p> <p></p> <p>Adobe is proud to be an <a>Equal Employment Opportunity</a> and affirmative action employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. <a>Learn more.</a>   </p> <p>Adobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email <a>accommodations@adobe.com </a> or call (408) 536-3015.</p> <p></p> <p>Adobe values a free and open marketplace for all employees and has policies in place to ensure that we do not enter into illegal agreements with other companies to not recruit or hire each other’s employees.</p>",
               "link": "https://zobjobs.com/job/software-frontend-development-engineer-typescript-front-end-developer-job-in-usa-zj6qet9u8l93",
               "category": [
                    "Front End Developer",
                    "Website"
               ],
               "location": "Seattle Washington US",
               "country": "US"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T04:34",
               "sourced": "public domain",
               "unique": 1386655,
               "companyName": "Adobe",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Software Frontend Development Engineer- TypeScript",
               "description": "Our Company\n\nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\n\nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\n\nThe challenge\n\nAdobe Express is an all-in-one design, photo, and video tool to make content creation easy. Quickly and easily make spectacular social content, videos, logos, and more to stand out on social and beyond.\n\nThe Express team is on a mission to build the most sophisticated, delightful and innovative editing experience for everything image, video and beyond, by pushing the boundaries of web technologies.\n\nWe are looking for an expert front-end engineer to add to the Imaging team, well rounded in the topics of web, browsers, design, architecture and image processing.\n\nWe are working in a large-scale project, yet as an independent autonomous team, and you will be able to take ownership and contribute to significant parts of the product, bringing life to features used by millions of users.\n\nWhat You’ll Do\n\n• Build amazing features in the Adobe Express product\n• Write high quality, production ready code\n• Use advanced web technologies\n• Apply groundbreaking technologies including AI/ML image and content generation\n• Contribute to an architecturally complex project\n• Be part of a team of exceptional engineers, designers, product and customer-experience experts\n• Operate a high reliability and stability SaaS product\n• Have the opportunity to define and influence features, priorities and roadmap\n• Work as part of a distributed team, active member of product and project communication channels\n\n\nWhat you need to succeed\n\n• Excellent proficiency in JavaScript, TypeScript, and in-depth knowledge of browser web technologies\n• Proficient in using/configuring the tooling to build, test and deliver large JavaScript/TypeScript applications (npm, rush, testing frameworks, node.js, headless)\n• Experience doing image processing, manipulation, compositing, or computer vision\n• Experience working effectively and operating independently in large software projects\n• Experience with web components, or proficient in one mainstream UI frameworks (React, Angular, etc.)\n• Design and architecture experience for complex front-end applications\n• Experience in improving memory and time performance in applications (web or native)\n• Knowledge and experience of browser technologies like WebGL, wasm, web workers, service workers, caching, local storage, debugging and profiling tools\n• Experience doing agile estimation, planning and working in an agile team\n• Customer insight and passion for a delightful user experience\n\n\nWhat will set you apart\n\nThese are nice to haves and should not discourage you from applying\n\n• Substantial public git portfolio to showcase your skills and passion for coding\n• Proven experience in anything computer vision, graphic rendering, 2D or 3D, AR/VR, 3D engines\n• Notable public media content (blogs, channels) or public presentations\n• Individual research or papers on any relevant technical topics\n\n\nOur compensation reflects the cost of labor across several U.S. geographic markets, and we pay differently based on those defined markets. The U.S. pay range for this positionis $124,000 -- $234,200 annually. Paywithin this range varies by work locationand may also depend on job-related knowledge, skills,and experience. Your recruiter can share more about the specific salary range for the job location during the hiring process.\n\nAt Adobe, for sales roles starting salaries are expressed as total target compensation (TTC = base + commission), and short-term incentives are in the form of sales commission plans. Non-sales roles starting salaries are expressed as base salary and short-term incentives are in the form of the Annual Incentive Plan (AIP).\n\nIn addition, certain roles may be eligible for long-term incentives in the form of a new hire equity award.\n\nAdobe is proud to be an Equal Employment Opportunity and affirmative action employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more.\n\nAdobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015.\n\nAdobe values a free and open marketplace for all employees and has policies in place to ensure that we do not enter into illegal agreements with other companies to not recruit or hire each other’s employees.",
               "link": "https://zobjobs.com/job/software-frontend-development-engineer-typescript-front-end-developer-job-in-usa-zj6qet9u8fl2",
               "category": [
                    "Front End Developer",
                    "Website"
               ],
               "location": "San Francisco CA US",
               "country": "US"
          },
          {
               "created": "2024-02-07T05:23:52+00:00",
               "expires": "2024-03-05T04:34",
               "sourced": "public domain",
               "unique": 1386654,
               "companyName": "Adobe",
               "companyUrl": "https://zobjobs.com/company/false",
               "title": "Software Frontend Development Engineer- TypeScript",
               "description": "Our Company\n  \nChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.\n  \nWe’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!\n  \nThe challenge\n Adobe Express is an all-in-one design, photo, and video tool to make content creation easy. Quickly and easily make spectacular social content, videos, logos, and more to stand out on social and beyond.\n The Express team is on a mission to build the most sophisticated, delightful and innovative editing experience for everything image, video and beyond, by pushing the boundaries of web technologies.\n We are looking for an expert front-end engineer to add to the Imaging team, well rounded in the topics of web, browsers, design, architecture and image processing.\n We are working in a large-scale project, yet as an independent autonomous team, and you will be able to take ownership and contribute to significant parts of the product, bringing life to features used by millions of users.\n What you’ll do\n Build amazing features in the Adobe Express product\n Write high quality, production ready code\n Use advanced web technologies\n Apply groundbreaking technologies including AI/ML image and content generation\n Contribute to an architecturally complex project\n Be part of a team of exceptional engineers, designers, product and customer-experience experts\n Operate a high reliability and stability SaaS product\n Have the opportunity to define and influence features, priorities and roadmap\n Work as part of a distributed team, active member of product and project communication channels\n What you need to succeed\n Excellent proficiency in JavaScript, TypeScript, and in-depth knowledge of browser web technologies\n Proficient in using/configuring the tooling to build, test and deliver large JavaScript/TypeScript applications (npm, rush, testing frameworks, node.js, headless)\n Experience doing image processing, manipulation, compositing, or computer vision\n Experience working effectively and operating independently in large software projects\n Experience with web components, or proficient in one mainstream UI frameworks (React, Angular, etc.)\n Design and architecture experience for complex front-end applications\n Experience in improving memory and time performance in applications (web or native)\n Knowledge and experience of browser technologies like WebGL, wasm, web workers, service workers, caching, local storage, debugging and profiling tools\n Experience doing agile estimation, planning and working in an agile team\n Customer insight and passion for a delightful user experience\n What will set you apart\n These are nice to haves and should not discourage you from applying\n Substantial public git portfolio to showcase your skills and passion for coding\n Proven experience in anything computer vision, graphic rendering, 2D or 3D, AR/VR, 3D engines\n Notable public media content (blogs, channels) or public presentations\n Individual research or papers on any relevant technical topics\n  \nOur compensation reflects the cost of labor across several U.S. geographic markets, and we pay differently based on those defined markets. The U.S. pay range for this position is $124,000 -- $234,200 annually. Pay within this range varies by work location and may also depend on job-related knowledge, skills, and experience. Your recruiter can share more about the specific salary range for the job location during the hiring process.\n  \nAt Adobe, for sales roles starting salaries are expressed as total target compensation (TTC = base + commission), and short-term incentives are in the form of sales commission plans. Non-sales roles starting salaries are expressed as base salary and short-term incentives are in the form of the Annual Incentive Plan (AIP).\n  \nIn addition, certain roles may be eligible for long-term incentives in the form of a new hire equity award.\n  \nAdobe is proud to be an Equal Employment Opportunity and affirmative action employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more.\n  \nAdobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015.\n  \nAdobe values a free and open marketplace for all employees and has policies in place to ensure that we do not enter into illegal agreements with other companies to not recruit or hire each other’s employees.",
               "link": "https://zobjobs.com/job/software-frontend-development-engineer-typescript-front-end-developer-job-in-usa-zj6qet9u8bv8",
               "category": [
                    "Front End Developer",
                    "Website"
               ],
               "location": "Seattle Washington State US",
               "country": "US"
          }
     ]
}